

package com.yundao.tenant.app.constant;
/**
 * Function: 
 * Reason:	  
 * Date:     2017年7月24日 下午1:51:42 
 * @author   wucq
 * @version   
 */
public interface CodeConstant {


    /**
     * 登录超时
     */
    int CODE_900000 = 900000;

    /**
     * 无效的身份标识
     */
    int CODE_900001 = 900001;

    /**
     * 无权限访问
     */
    int CODE_900002 = 900002;

    /**
     * 域名未授权
     */
    int CODE_900003 = 900003;
    /**
     * 该帐号未授权
     */
    int CODE_900004 = 900004;
    /**
     * 域名未授权
     */
    int CODE_900005 = 900005;

    /**
     * 数据创建者为空
     */
    int CODE_900006 = 900006;

    /**
     * 登录已过期
     */
    int CODE_900007 = 900007;

    /**
     * 未认证登录
     */
    int CODE_900008 = 900008;

    /**
     * 请在DTO标注“FieldCode”注解
     */
    int CODE_900009 = 900009;

    /**
     * id不能为空
     */
    int CODE_1200000 = 1200000;

    /**
     * 您没有权限
     */
    int CODE_1220015 = 1220015;

    /**
     * 无权限修改
     */
    int CODE_1220016 = 1220016;


    /**
     * 无权限对象以下数据进行删除操作
     */
    int CODE_1220019 = 1220019;

    /**
     * 无效的数据对象编码
     */
    int CODE_1220035 = 1220035;


    /**以上为web端迁移过来的CODE**/

	/**
     * 设备ID有误
     */
    int CODE_1300000 = 1300000;
    /**
     * 设备名称不能为空
     */
    int CODE_1300001 = 1300001;
    /**
     * 设备分辨率不能为空
     */
    int CODE_1300002 = 1300002;
    /**
     * 设备操作系统不能为空
     */
    int CODE_1300003 = 1300003;
    /**
     * 登录凭证不能为空
     */
    int CODE_1300004 = 1300004;
    /**
     * ticket加密值有误
     */
    int CODE_1300005 = 1300005;
    /**
     * 签名值有误
     */
    int CODE_1300006 = 1300006;
    /**
     * 认证已过期
     */
    int CODE_1300007 = 1300007;
    /**
     * 租户code编码无效
     */
    int CODE_1300008 = 1300008;
    /**
     * 应用ID有误
     */
    int CODE_1300009 = 1300009;
    /**
     * 设备ID有误
     */
    int CODE_1300010 = 1300010;
    /**
     * 系统标识有误
     */
    int CODE_1300011 = 1300011;
    /**
     * 版本有误
     */
    int CODE_1300012 = 1300012;
    /**
     * 链接已超时
     */
    int CODE_1300013 = 1300013;
    /**
     * 无效帐号，请联系系统管理员!
     */
    int CODE_1300014 = 1300014;
    /**
     * 搜索类型不能为空
     */
    int CODE_1300015 = 1300015;
    /**
     * 客户ID不能为空
     */
    int CODE_1300016 = 1300016;
    /**
     * 该文件格式不支持
     */
    int CODE_1300017 = 1300017;
    /**
     * 预约金额不能为空
     */
    int CODE_1300018 = 1300018;
    /**
     * 栏目ID不存在
     */
    int CODE_1300019 = 1300019;
    /**
     * 预约ID不能为空
     */
    int CODE_1300020 = 1300020;
    /**
     * 预约时间不能为空
     */
    int CODE_1300021 = 1300021;

    /**
     * 报单ID不能为空
     */
    int CODE_1300022 = 1300022;

    /**
     * 产品不存在
     */
    int CODE_1300023 = 1300023;
    /**
     * 新增失败
     */
    int CODE_1300024 = 1300024;
    /**
     * 处理方式不能为空
     */
    int CODE_1300025 = 1300025;
    /**
     * 处理方式参数不正确
     */
    int CODE_1300026 = 1300026;
    /**
     * 获取用户信息失败
     */
    int CODE_1300027 = 1300027;
    /**
     * 没有找到对应的业务类型
     */
    int CODE_1300028 = 1300028;
    /**
     * 业务类型没有处理类
     */
    int CODE_1300029 = 1300029;
    /**
     * 预约不存在
     */
    int CODE_1300030 = 1300030;
    /**
     * 没有找到流程实例
     */
    int CODE_1300031 = 1300031;
    /**
     * 动作有误
     */
    int CODE_1300032 = 1300032;
    /**
     * 业务状态有误
     */
    int CODE_1300033 = 1300033;
    /**
     * 取消原因不能为空
     */
    int CODE_1300034 = 1300034;
    /**
     * 用户已被停用
     */
    int CODE_1300035= 1300035;
    /**
     * 无权限操作
     */
    int CODE_1300036 = 1300036;
    /**
     * 产品公告不存在
     */
    int CODE_1300037 = 1300037;
    
    /**
     * 暂无权限查看
     */
    int CODE_1300038 = 1300038;
    
    
    /**
     * 请选择部门或者用户
     */
    int CODE_1300039 = 1300039;
    
    /**
     * 部门不存在
     */
    int CODE_1200004 = 1200004;
    /**
     * 栏目ID不能为空
     */
    int CODE_1300040 = 1300040;
    /**
     * 客户暂无销售线索信息
     */
    int CODE_1300041 = 1300041;
    /**
     * 该客户已分配给其它用户
     */
    int CODE_1300042 = 1300042;
}

